Tekla Open API Reference for Tekla Structures 2025
Operation Methods
The Operation type exposes the following members.
Methods
Name | Description
AddToPourUnit
 Adds model objects as part of a pour unit Model object types accepted are assembly types except cast in situ, reinforcements of different kind, components and bolts
CalculatePourUnits
 Calculate and assign objects to pour unit Model object types that are associated with pour unit are assembly types except cast in situ, reinforcements of different kind, components and screws
Combine(Beam, Beam)
 Combines two beams into one beam.
Combine(RebarGroup, RebarGroup)
 Combines two rebar groups into one rebar group.
Combine(SingleRebar, SingleRebar)
 Combines two single rebars into one rebar.
ConvertPartToItem
 Convert a part to an item. This will also create a new shape in the shape catalog.
CopyObject(ModelObject, Vector)
 Copies the model object using the given translation vector.
CopyObject(ModelObject, CoordinateSystem, CoordinateSystem)
 Copies the model object between the given translation coordinate systems.
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. See CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, BentPlate.BendShape).
CreateBentPlateByFaces(Part, Face, Part, Face)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. See CreateBentPlateByFaces(Part, Face, Part, Face, BentPlate.BendShape).
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts, selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, BentPlate.BendShape).
CreateBentPlateByFaces(Part, Face, Part, Face, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateBentPlateByFaces(Part, Face, Part, Face, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, BentPlate.BendShape).
CreateBentPlateByParts(Part, Part)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts. See CreateBentPlateByParts(Part, Part, BentPlate.BendShape).
CreateBentPlateByParts(Part, Part, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and a radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, Double).
CreateBentPlateByParts(Part, Part, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, BentPlate.BendShape).
CreateConicalBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, Double, Double)
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts, selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateConicalBentPlateByFaces(Part, Face, Part, Face, Double, Double)
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part, and the largest radius of the conical section and the cone aperture. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateConicalBentPlateByPartsAndAperture
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts. The resulting bend will have the given aperture and the provided larger radius.
CreateConicalBentPlateByPartsAndTwoRadiuses
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts. The resulting bend will have the two given radiuses.
CreateDGNv8Export
 Dgn export from all or selected objects.
CreateIFC4ExportFromAll
 Creates IFC4 export from all objects using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
CreateIFC4ExportFromSelected
 Creates IFC4 export from the selected parts using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
CreateMISFileFromAll
 Creates MIS files from all parts using the given file name.
See Tekla Structures Help for more information about MIS files.
CreateMISFileFromSelected
 Creates MIS files from the selected parts using the given file name.
See Tekla Structures Help for more information about MIS files.
CreateNCFilesByPartId
 Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromAll(String, String)
 Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromAll(String, String, Boolean, String, Boolean, String)
 Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromSelected(String, String)
 Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromSelected(String, String, Boolean, String, Boolean, String)
 Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateReportFromAll
 Creates a report from all the objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
Internally, this method is asynchronous, and because of that the output file cannot be immediately available.
See Tekla Structures Help for more information about reports.
CreateReportFromSelected
 Creates a report from the selected objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
See Tekla Structures Help for more information about reports.
CreateShapeFromGeometry
 Create a new shape in the shape catalog, based on the part geometry.
DisplayPrompt
 Displays a message in the status bar.
DisplayReport
 Opens and displays a report with the given name.
If a path is not given in the filename, the file is searched from the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
See Tekla Structures Help for more information about reports.
ExplodeBentPlate
 Deletes bentPlate and inserts ContourPlates instances equivalent to the ones used to create bentPlate. The ContourPlate created from the main polygon has the same identifier as bentPlate.
GetHandlePoints
 Get the Shape Item Handle Points
GetSimilarNumberedObjects
 Gets similar objects based on numbering of given object.
Group
 Groups a list of single rebars or rebar groups and creates a new rebar group.
Highlight
 Highlight the list of objects from the user interface. Only the list of objects will be highlighted, the rest will be unhighlighted. But it will keep the status of the selected objects. To unhighlight give an empty list as a parameter.
IsMacroRunning
 Returns true if a macro is running, false otherwise.
Macros are saved as *.cs files in the folder defined with the XS_MACRO_DIRECTORY variable.
See Tekla Structures Help for more information about macros.
IsModelAutoSaved |  Obsolete.
Tells whether a model has auto saved information.
IsNumberingAllowed
 Checks whether the numbering is allowed or not in the current configuration.
IsNumberingUpToDate
 Checks whether the numbering is up-to-date for an assembly, part, rebar, surface treatment, pour object or break.
IsNumberingUpToDateAll
 Checks whether the numbering is up-to-date for every assembly, part and rebar on the model.
Remarks
 Using this method is much faster than checking each object individually.
MoveObject(ModelObject, Vector)
 Moves the model object using the given translation vector.
MoveObject(ModelObject, CoordinateSystem, CoordinateSystem)
 Moves the model object between the given translation coordinate systems.
ObjectMatchesToFilter(ModelObject, String)
 Checks whether the object matches to the criteria in the given filter.
ObjectMatchesToFilter(ModelObject, FilterExpression)
 Checks whether the object matches to the criteria in the given filter.
Open(String) |  Obsolete.
Opens a new model to Tekla Structures ignoring auto saved information.
Open(String, Boolean) |  Obsolete.
Opens a new model to Tekla Structures.
RemoveFromPourUnit
 Removes model object from pour unit Model object types accepted are assembly types except cast in situ, reinforcements of different kind, components and bolts
RunMacro
 Starts a macro with the given name. Throws an exception if the file is not found.
Macros are saved as *.cs files in the folder defined with the XS_MACRO_DIRECTORY variable.
It is possible to run drawing macros using relative paths.
See Tekla Structures Help for more information about macros.
SaveAsWebModel
 Saves the current model as a web model.
You can save the model as a web model that can be viewed via the Internet using a web browser (e.g. Internet Explorer).
SaveSelectedAsWebModel
 Saves the selected objects as a web model.
You can save the selected objects as a web model that can be viewed via the Internet using a web browser (e.g. Internet Explorer).
SetHandlePoints
 Set the Shape Item Handle Points
ShowOnlySelected
Show Only Selected objects in current view.
Split(Beam, Point)
 Splits the beam and creates a new one in the given position.
Split(CircleRebarGroup, Line)
 Splits the circle rebar group and creates a new one in the given position.
Split(ContourPlate, Polygon)
 Splits the contour plate and creates a new one along the given polygon.
Split(CurvedRebarGroup, Line)
 Splits the curved rebar group and creates a new one in the given position.
Split(LoftedPlate, Point)
 Splits the lofted plate and creates a new one in the given position.
Split(PolyBeam, Point)
 Splits the polybeam and creates a new one in the given position.
Split(RebarGroup, Line)
 Splits the rebar group and creates a new one in the given position.
Split(SingleRebar, Line)
 Splits the single rebar and creates a new one in the given position.
SplitSlab
 This command is meant for specifically splitting a concrete slab with advanced solid operations to create more robust and user friendly results than the command: public static ContourPlate Split(ContourPlate Object, Polygon SplitPolygon). No validation is done for the type, it is the caller's responsibility to call this only for valid types (slabs). Behavior for non-slabs is undetermined.
Ungrouping(RebarGroup)
 Ungroups the rebar group and creates new single rebars.
Ungrouping(RebarMesh)
 Ungroups the rebar mesh and creates new single rebars.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace